Ext.define('ExFrm.view.sin.sin001p_03_01Model', {
    extend:'Ext.app.ViewModel', 
    alias: 'viewmodel.sin001p_03_01', 
    stores:{
    	ds_man:{
            fields:['field1'],
            data:[{
                A:'할아버지',B:'조부',C:'복위',D:'후인',E:'T', F : 'T'
            },{
            	A:'할머니',B:'조모',C:'복위',D:'유인',E:'T', F : 'F'
            },{
            	A:'아버지',B:'엄부',C:'복위',D:'후인',E:'T', F : 'T'
            },{
            	A:'어머니',B:'자모',C:'복위',D:'유인',E:'T', F : 'F'
            },{
            	A:'큰아버지',B:'선백부',C:'복위',D:'후인',E:'T', F : 'T'
            },{
            	A:'아내',B:'망부인',C:'기부',D:'유인',E:'F', F : 'F'
            },{
            	A:'형',B:'선사형',C:'복위',D:'후인',E:'T', F : 'T'
            },{
            	A:'형수',B:'선형수',C:'복위',D:'유인',E:'F', F : 'F'
            },{
            	A:'동생',B:'망사제',C:'기부',D:'유인',E:'F', F : 'T'
            },{
            	A:'제수',B:'망제수',C:'기부',D:'유인',E:'F', F : 'F'
            },{
            	A:'누나',B:'선매수',C:'복위',D:'유인',E:'F', F : 'F'
            },{
            	A:'여동생',B:'망여사제',C:'기부',D:'유인',E:'F', F : 'F'
            },{
            	A:'(5대)할아버지',B:'혀조부',C:'복위',D:'유인',E:'T', F : 'T'
            },{
            	A:'(5대)할머니',B:'현조모',C:'복위',D:'유인',E:'T', F : 'F'
            },{
            	A:'(4대)할아버지',B:'고조부',C:'복위',D:'후인',E:'T', F : 'T'
            },{
            	A:'(4대)할머니',B:'고조모',C:'복위',D:'유인',E:'T', F : 'F'
            },{
            	A:'(3대)할아버지',B:'승조부',C:'복위',D:'후인',E:'T', F : 'T'
            },{
            	A:'(3대)할머니',B:'승조모',C:'복위',D:'유인',E:'T', F : 'F'
            }],
            autoLoad:true
        },
        ds_woman:{
            fields:['field1'],
            data:[{
                A:'할아버지',B:'조부',C:'복위',D:'후인',E:'T', F : 'T'
            },{
            	A:'할머니',B:'조모',C:'복위',D:'유인',E:'T', F : 'F'
            },{
            	A:'아버지',B:'엄부',C:'복위',D:'후인',E:'T', F : 'T'
            },{
            	A:'어머니',B:'자모',C:'복위',D:'유인',E:'T', F : 'F'
            },{
            	A:'큰아버지',B:'선백부',C:'복위',D:'후인',E:'T', F : 'T'
            },{
            	A:'남편',B:'선가부',C:'기부',D:'후인',E:'T', F : 'T'
            },{
            	A:'여동생',B:'망여사제',C:'기부',D:'유인',E:'F', F : 'F'
            },{
            	A:'오빠',B:'선남사형',C:'복위',D:'후인',E:'T', F : 'T'
            },{
            	A:'언니',B:'선여사형',C:'복위',D:'유인',E:'T', F : 'F'
            },{
            	A:'(5대)할아버지',B:'혀조부',C:'복위',D:'유인',E:'T', F : 'T'
            },{
            	A:'(5대)할머니',B:'현조모',C:'복위',D:'유인',E:'T', F : 'F'
            },{
            	A:'(4대)할아버지',B:'고조부',C:'복위',D:'후인',E:'T', F : 'T'
            },{
            	A:'(4대)할머니',B:'고조모',C:'복위',D:'유인',E:'T', F : 'F'
            },{
            	A:'(3대)할아버지',B:'승조부',C:'복위',D:'후인',E:'T', F : 'T'
            },{
            	A:'(3대)할머니',B:'승조모',C:'복위',D:'유인',E:'T', F : 'F'
            }],
            autoLoad:true
        }
    }
});